#include <stdio.h>
#include <stdlib.h>
#include <ctype.h>
#include <math.h>

/**
 * @brief Обчислює вираз математичних виразів.
 *
 * Функція отримує рядок, що представляє математичний вираз, і обчислює його значення.
 * Вираз може містити цілі числа, операції додавання, віднімання, множення, ділення, залишок від ділення,
 * піднесення до степеня та оператори групування в дужках.
 *
 * @param expression Рядок, що містить математичний вираз.
 * @return Результат обчислення виразу.
 */
int calculator(char *expression);

/**
 * @brief Виконує операцію над двома числами.
 *
 * Функція виконує операцію, зазначену оператором, над двома числами на вершині числового стеку.
 * Результат операції зберігається на вершині стеку.
 *
 * @param numStack Вказівник на масив числового стеку.
 * @param opStack Вказівник на масив операторного стеку.
 * @param numTop Вказівник на змінну, що вказує на вершину числового стеку.
 * @param opTop Вказівник на змінну, що вказує на вершину операторного стеку.
 */
void exponent(int *numStack, char *opStack, int *numTop, int *opTop);

/**
 * @brief Виконує операцію над двома числами.
 *
 * Функція виконує операцію, зазначену оператором, над двома числами на вершині числового стеку.
 * Результат операції зберігається на вершині стеку.
 *
 * @param numStack Вказівник на масив числового стеку.
 * @param opStack Вказівник на масив операторного стеку.
 * @param numTop Вказівник на змінну, що вказує на вершину числового стеку.
 * @param opTop Вказівник на змінну, що вказує на вершину операторного стеку.
 */
int priority(char operator);
